# -*- coding: utf-8 -*-
from ..person import Provider as PersonProvider


class Provider(PersonProvider):
    formats = (
        '{{last_name_m}} {{first_name_m}} {{middle_name_m}}',
        '{{last_name_m}} {{first_name_m}}',
        '{{first_name_m}} {{middle_name_m}} {{last_name_m}}',
        '{{last_name_f}} {{first_name_f}} {{middle_name_f}}',
        '{{last_name_f}} {{first_name_f}}',
        '{{first_name_f}} {{middle_name_f}} {{last_name_f}}',
    )

    last_names_m = (
        u'Абрамов', u'Авдеев', u'Агафонов', u'Аксёнов', u'Александров', u'Алексеев', u'Андреев', u'Анисимов', u'Антонов', u'Артемьев', u'Архипов', u'Афанасьев',
        u'Баранов', u'Белов', u'Белозёров', u'Белоусов', u'Беляев', u'Беляков', u'Беспалов', u'Бирюков', u'Блинов', u'Блохин', u'Бобров', u'Бобылёв', u'Богданов', u'Большаков', u'Борисов', u'Брагин', u'Буров', u'Быков',
        u'Васильев', u'Веселов', u'Виноградов', u'Вишняков', u'Владимиров', u'Власов', u'Волков', u'Воробьёв', u'Воронов', u'Воронцов',
        u'Гаврилов', u'Галкин', u'Герасимов', u'Голубев', u'Горбачёв', u'Горбунов', u'Гордеев', u'Горшков', u'Григорьев', u'Гришин', u'Громов', u'Гуляев', u'Гурьев', u'Гусев', u'Гущин',
        u'Давыдов', u'Данилов', u'Дементьев', u'Денисов', u'Дмитриев', u'Доронин', u'Дорофеев', u'Дроздов', u'Дьячков',
        u'Евдокимов', u'Евсеев', u'Егоров', u'Елисеев', u'Емельянов', u'Ермаков', u'Ершов', u'Ефимов', u'Ефремов',
        u'Жданов', u'Жуков', u'Журавлёв',
        u'Зайцев', u'Захаров', u'Зимин', u'Зиновьев', u'Зуев', u'Зыков',
        u'Иванов', u'Игнатов', u'Игнатьев', u'Ильин', u'Исаев', u'Исаков',
        u'Кабанов', u'Казаков', u'Калашников', u'Калинин', u'Капустин', u'Карпов', u'Кириллов', u'Киселёв', u'Князев', u'Ковалёв', u'Козлов', u'Колесников', u'Колобов', u'Комаров', u'Комиссаров', u'Кондратьев', u'Коновалов', u'Кононов', u'Константинов', u'Копылов', u'Корнилов', u'Королёв', u'Костин', u'Котов', u'Кошелев', u'Красильников', u'Крылов', u'Крюков', u'Кудрявцев', u'Кудряшов', u'Кузнецов', u'Кузьмин', u'Кулагин', u'Кулаков', u'Куликов',
        u'Лаврентьев', u'Лазарев', u'Лапин', u'Ларионов', u'Лебедев', u'Лихачёв', u'Лобанов', u'Логинов', u'Лукин', u'Лыткин',
        u'Макаров', u'Максимов', u'Мамонтов', u'Марков', u'Мартынов', u'Маслов', u'Матвеев', u'Медведев', u'Мельников', u'Меркушев', u'Миронов', u'Михайлов', u'Михеев', u'Мишин', u'Моисеев', u'Молчанов', u'Морозов', u'Муравьёв', u'Мухин', u'Мясников',
        u'Назаров', u'Наумов', u'Некрасов', u'Нестеров', u'Никитин', u'Никифоров', u'Николаев', u'Никонов', u'Новиков', u'Носков', u'Носов',
        u'Овчинников', u'Одинцов', u'Орехов', u'Орлов', u'Осипов',
        u'Павлов', u'Панов', u'Панфилов', u'Пахомов', u'Пестов', u'Петров', u'Петухов', u'Поляков', u'Пономарёв', u'Попов', u'Потапов', u'Прохоров',
        u'Рогов', u'Родионов', u'Рожков', u'Романов', u'Русаков', u'Рыбаков', u'Рябов',
        u'Савельев', u'Савин', u'Сазонов', u'Самойлов', u'Самсонов', u'Сафонов', u'Селезнёв', u'Селиверстов', u'Семёнов', u'Сергеев', u'Сидоров', u'Силин', u'Симонов', u'Ситников', u'Смирнов', u'Соболев', u'Соколов', u'Соловьёв', u'Сорокин', u'Степанов', u'Стрелков', u'Субботин', u'Суворов', u'Суханов', u'Сысоев',
        u'Тарасов', u'Терентьев', u'Тетерин', u'Тимофеев', u'Титов', u'Тихонов', u'Третьяков', u'Трофимов', u'Туров',
        u'Уваров', u'Устинов', u'Фадеев', u'Фёдоров', u'Федосеев', u'Федотов', u'Филатов', u'Филиппов', u'Фокин', u'Фомин', u'Фомичёв', u'Фролов',
        u'Харитонов', u'Хохлов', u'Цветков', u'Чернов', u'Шарапов', u'Шаров', u'Шашков', u'Шестаков', u'Шилов', u'Ширяев', u'Шубин', u'Щербаков', u'Щукин', u'Юдин', u'Яковлев',
    )

    last_names_f = (
        u'Абрамова', u'Авдеева', u'Агафонова', u'Аксёнова', u'Александрова', u'Алексеева', u'Андреева', u'Анисимова', u'Антонова', u'Артемьева', u'Архипова', u'Афанасьева',
        u'Баранова', u'Белова', u'Белозёрова', u'Белоусова', u'Беляева', u'Белякова', u'Беспалова', u'Бирюкова', u'Блинова', u'Блохина', u'Боброва', u'Бобылёва', u'Богданова', u'Большакова', u'Борисова', u'Брагина', u'Бурова', u'Быкова',
        u'Васильева', u'Веселова', u'Виноградова', u'Вишнякова', u'Владимирова', u'Власова', u'Волкова', u'Воробьёва', u'Воронова', u'Воронцова',
        u'Гаврилова', u'Галкина', u'Герасимова', u'Голубева', u'Горбачёва', u'Горбунова', u'Гордеева', u'Горшкова', u'Григорьева', u'Гришина', u'Громова', u'Гуляева', u'Гурьева', u'Гусева', u'Гущина',
        u'Давыдова', u'Данилова', u'Дементьева', u'Денисова', u'Дмитриева', u'Доронина', u'Дорофеева', u'Дроздова', u'Дьячкова',
        u'Евдокимова', u'Евсеева', u'Егорова', u'Елисеева', u'Емельянова', u'Ермакова', u'Ершова', u'Ефимова', u'Ефремова',
        u'Жданова', u'Жукова', u'Журавлёва',
        u'Зайцева', u'Захарова', u'Зимина', u'Зиновьева', u'Зуева', u'Зыкова',
        u'Иванова', u'Игнатова', u'Игнатьева', u'Ильина', u'Исаева', u'Исакова',
        u'Кабанова', u'Казакова', u'Калашникова', u'Калинина', u'Капустина', u'Карпова', u'Кириллова', u'Киселёва', u'Князева', u'Ковалёва', u'Козлова', u'Колесникова', u'Колобова', u'Комарова', u'Комиссарова', u'Кондратьева', u'Коновалова', u'Кононова', u'Константинова', u'Копылова', u'Корнилова', u'Королёва', u'Костина', u'Котова', u'Кошелева', u'Красильникова', u'Крылова', u'Крюкова', u'Кудрявцева', u'Кудряшова', u'Кузнецова', u'Кузьмина', u'Кулагина', u'Кулакова', u'Куликова',
        u'Лаврентьева', u'Лазарева', u'Лапина', u'Ларионова', u'Лебедева', u'Лихачёва', u'Лобанова', u'Логинова', u'Лукина', u'Лыткина',
        u'Макарова', u'Максимова', u'Мамонтова', u'Маркова', u'Мартынова', u'Маслова', u'Матвеева', u'Медведева', u'Мельникова', u'Меркушева', u'Миронова', u'Михайлова', u'Михеева', u'Мишина', u'Моисеева', u'Молчанова', u'Морозова', u'Муравьёва', u'Мухина', u'Мясникова',
        u'Назарова', u'Наумова', u'Некрасова', u'Нестерова', u'Никитина', u'Никифорова', u'Николаева', u'Никонова', u'Новикова', u'Носкова', u'Носова',
        u'Овчинникова', u'Одинцова', u'Орехова', u'Орлова', u'Осипова',
        u'Павлова', u'Панова', u'Панфилова', u'Пахомова', u'Пестова', u'Петрова', u'Петухова', u'Полякова', u'Пономарёва', u'Попова', u'Потапова', u'Прохорова',
        u'Рогова', u'Родионова', u'Рожкова', u'Романова', u'Русакова', u'Рыбакова', u'Рябова',
        u'Савельева', u'Савина', u'Сазонова', u'Самойлова', u'Самсонова', u'Сафонова', u'Селезнёва', u'Селиверстова', u'Семёнова', u'Сергеева', u'Сидорова', u'Силина', u'Симонова', u'Ситникова', u'Смирнова', u'Соболева', u'Соколова', u'Соловьёва', u'Сорокина', u'Степанова', u'Стрелкова', u'Субботина', u'Суворова', u'Суханова', u'Сысоева',
        u'Тарасова', u'Терентьева', u'Тетерина', u'Тимофеева', u'Титова', u'Тихонова', u'Третьякова', u'Трофимова', u'Турова',
        u'Уварова', u'Устинова', u'Фадеева', u'Фёдорова', u'Федосеева', u'Федотова', u'Филатова', u'Филиппова', u'Фокина', u'Фомина', u'Фомичёва', u'Фролова',
        u'Харитонова', u'Хохлова', u'Цветкова', u'Чернова', u'Шарапова', u'Шарова', u'Шашкова', u'Шестакова', u'Шилова', u'Ширяева', u'Шубина', u'Щербакова', u'Щукина', u'Юдина', u'Яковлева', u'Якушева',
    )

    first_names_m = (
        u'Аарон', u'Абрам', u'Аваз', u'Аввакум', u'Август', u'Авдей', u'Авраам', u'Автандил', u'Агап', u'Агафон', u'Аггей', u'Адам', u'Адис', u'Адольф', u'Адриан', u'Азарий', u'Азат', u'Айрат', u'Акакий', u'Аким', u'Алан', u'Александр', u'Алексей', u'Али', u'Алихан', u'Алоиз', u'Альберт', u'Альфред', u'Амадей', u'Амадеус', u'Амаяк', u'Амвросий', u'Анатолий', u'Анвар', u'Ангел', u'Андоим', u'Андре', u'Андрей', u'Аникита', u'Антон', u'Ануфрий', u'Аполлинарий', u'Арам', u'Арий', u'Аристарх', u'Аркадий', u'Арман', u'Армен', u'Арно', u'Арнольд', u'Арсений', u'Арслан', u'Артем', u'Артемий', u'Артур', u'Архип', u'Аскольд', u'Афанасий', u'Ахмет', u'Ашот',
        u'Бежен', u'Бенедикт', u'Берек', u'Бернар', u'Богдан', u'Боголюб', u'Болеслав', u'Бонифаций', u'Борис', u'Борислав', u'Боян', u'Бруно', u'Булат',
        u'Вадим', u'Валентин', u'Валерий', u'Вальтер', u'Вардан', u'Варлаам', u'Варфоломей', u'Василий', u'Вацлав', u'Велизар', u'Велор', u'Венедикт', u'Вениамин', u'Викентий', u'Виктор', u'Вилен', u'Вилли', u'Вильгельм', u'Виссарион', u'Виталий', u'Витаутас', u'Витольд', u'Владимир', u'Владислав', u'Владлен', u'Влас', u'Володар', u'Вольдемар', u'Всеволод', u'Вячеслав',
        u'Гавриил', u'Галактион', u'Гарри', u'Гастон', u'Гаяс', u'Гевор', u'Геворг', u'Геннадий', u'Генрих', u'Георгий', u'Геральд', u'Герасим', u'Герман', u'Глеб', u'Гордей', u'Гордон', u'Горислав', u'Градимир', u'Григорий', u'Гурий', u'Густав',
        u'Давид', u'Дамир', u'Даниил', u'Данияр', u'Демид', u'Демьян', u'Денис', u'Джамал', u'Джереми', u'Джордан', u'Динасий', u'Дмитрий', u'Добрыня', u'Дональд', u'Донат', u'Донатос', u'Дорофей',
        u'Евгений', u'Евграф', u'Евдоким', u'Евсей', u'Евстафий', u'Егор', u'Елизар', u'Елисей', u'Емельян', u'Еремей', u'Ермолай', u'Ерофей', u'Ефим', u'Ефимий', u'Ефрем',
        u'Жан', u'Ждан', u'Жорж', u'Заур', u'Захар', u'Зигмунд', u'Зиновий',
        u'Ибрагим', u'Иван', u'Игнат', u'Игорь', u'Иероним', u'Измаил', u'Израиль', u'Илиан', u'Илларион', u'Ильхам', u'Илья', u'Ильяс', u'Иннокентий', u'Ион', u'Ионос', u'Иосиф', u'Ипполит', u'Ираклий', u'Иржи', u'Исаак', u'Исай', u'Исидор', u'Искандер',
        u'Казимир', u'Камиль', u'Карен', u'Карим', u'Карл', u'Ким', u'Кирилл', u'Клавдий', u'Клаус', u'Клемент', u'Клим', u'Клод', u'Кондрат', u'Конкордий', u'Конрад', u'Константин', u'Корней', u'Корнилий', u'Ксанф', u'Кузьма',
        u'Лаврентий', u'Лазарь', u'Лев', u'Леван', u'Левон', u'Ленар', u'Леон', u'Леонард', u'Леонид', u'Леонтий', u'Леопольд', u'Лука', u'Лукьян', u'Любим', u'Любомир', u'Людвиг', u'Люсьен',
        u'Мадлен', u'Май', u'Макар', u'Максим', u'Максимилиан', u'Максуд', u'Мансур', u'Мануил', u'Марат', u'Мариан', u'Марк', u'Марсель', u'Мартин', u'Матвей', u'Махмуд', u'Мераб', u'Мефодий', u'Мечеслав', u'Милан', u'Мирон', u'Мирослав', u'Митрофан', u'Михаил', u'Мичлов', u'Модест', u'Моисей', u'Мстислав', u'Мурат', u'Муслим',
        u'Назар', u'Назарий', u'Наиль', u'Натан', u'Наум', u'Нестор', u'Никанор', u'Никита', u'Никифор', u'Никодим', u'Николай', u'Никон', u'Нильс', u'Нисон', u'Нифонт', u'Норманн',
        u'Овидий', u'Олан', u'Олег', u'Олесь', u'Онисим', u'Орест', u'Осип', u'Оскар', u'Остап',
        u'Павел', u'Панкрат', u'Парамон', u'Петр', u'Пимен', u'Платон', u'Порфирий', u'Потап', u'Прокофий', u'Прохор',
        u'Равиль', u'Радий', u'Раймонд', u'Раис', u'Рамиз', u'Рамиль', u'Расим', u'Ратибор', u'Ратмир', u'Рафаил', u'Рафик', u'Рашид', u'Рем', u'Ренольд', u'Ринат', u'Рифат', u'Рихард', u'Ричард', u'Роберт', u'Родион', u'Ролан', u'Роман', u'Ростислав', u'Рубен', u'Рудольф', u'Руслан', u'Рустам', u'Рушан',
        u'Сабир', u'Савва', u'Савелий', u'Самсон', u'Самуил', u'Святослав', u'Севастьян', u'Северин', u'Семен', u'Серафим', u'Сергей', u'Сократ', u'Соломон', u'Спартак', u'Стакрат', u'Станимир', u'Станислав', u'Степан', u'Стивен', u'Стоян', u'Султан',
        u'Таис', u'Талик', u'Тамаз', u'Тарас', u'Тельман', u'Теодор', u'Терентий', u'Тибор', u'Тигран', u'Тигрий', u'Тимофей', u'Тимур', u'Тит', u'Тихон', u'Томас', u'Трифон', u'Трофим',
        u'Ульманас', u'Устин', u'Фаддей', u'Фанис', u'Фарид', u'Фархад', u'Федор', u'Федот', u'Феликс', u'Феодосий', u'Фердинанд', u'Фидель', u'Филимон', u'Филипп', u'Флорентий', u'Фома', u'Франц', u'Фридрих', u'Фуад',
        u'Харитон', u'Христиан', u'Христос', u'Христофор', u'Цезарь', u'Чеслав', u'Чингиз', u'Шамиль', u'Шерлок',
        u'Эдвард', u'Эдгар', u'Эдмунд', u'Эдуард', u'Эльдар', u'Эмиль', u'Эмин', u'Эммануил', u'Эраст', u'Эрик', u'Эрнест',
        u'Юлиан', u'Юлий', u'Юрий', u'Юхим', u'Яким', u'Яков', u'Ян', u'Януарий', u'Яромир', u'Ярослав', u'Ясон',
    )

    first_names_f = (
        u'Августа', u'Аврора', u'Агата', u'Агафья', u'Аглая', u'Агнесса', u'Агния', u'Агриппина', u'Агунда', u'Ада', u'Аделина', u'Адель', u'Адиля', u'Адриана', u'Аза', u'Азалия', u'Азиза', u'Айгуль', u'Аида', u'Айжан', u'Аксинья', u'Акулина', u'Алана', u'Алевтина', u'Александра', u'Алена', u'Алико', u'Алина', u'Алиса', u'Алия', u'Алла', u'Алсу', u'Альберта', u'Альбина', u'Альвина', u'Альжбета', u'Альфия', u'Альфреда', u'Амаль', u'Амелия', u'Амина', u'Анастасия', u'Ангелина', u'Анеля', u'Анжела', u'Анисья', u'Анита', u'Анна', u'Антонина', u'Ануш', u'Анфиса', u'Аполлинария', u'Ариадна', u'Ариана', u'Арина', u'Архелия', u'Асия', u'Ассоль', u'Астра', u'Астрид', u'Ася', u'Аурелия', u'Афанасия', u'Аэлита',
        u'Беатриса', u'Белла', u'Бенедикта', u'Береслава', u'Берта', u'Биргит', u'Бирута', u'Богдана', u'Божена', u'Борислава', u'Бронислав', u'Бронислава',
        u'Валентина', u'Валерия', u'Ванда', u'Варвара', u'Василина', u'Василиса', u'Венера', u'Вера', u'Вероника', u'Веселина', u'Весна', u'Веста', u'Вета', u'Вида', u'Виктория', u'Вилора', u'Виолетта', u'Виргиния', u'Виринея', u'Виталия', u'Владислава', u'Владлена',
        u'Габриэлла', u'Галина', u'Гаянэ', u'Гелена', u'Гелла', u'Генриетта', u'Георгина', u'Гера', u'Гертруда', u'Глафира', u'Глория', u'Гортензия', u'Гражина', u'Грета', u'Гузель', u'Гулия', u'Гульмира', u'Гульназ', u'Гульнара',
        u'Дайна', u'Далия', u'Дамира', u'Дана', u'Даниэла', u'Данута', u'Дарина', u'Дарья', u'Дебора', u'Джамиля', u'Джемма', u'Джулия', u'Джульетта', u'Диана', u'Дилара', u'Диля', u'Дина', u'Динара', u'Диодора', u'Дионисия', u'Доля', u'Доминика', u'Дора',
        u'Ева', u'Евангелина', u'Евгения', u'Евдокия', u'Екатерина', u'Елена', u'Елизавета', u'Есения', u'Ефимия',
        u'Жанна', u'Жасмин', u'Жозефина', u'Забава', u'Заира', u'Замира', u'Зара', u'Зарема', u'Зарина', u'Захария', u'Земфира', u'Зинаида', u'Зита', u'Злата', u'Зоя', u'Зульфия', u'Зухра',
        u'Иванна', u'Иветта', u'Ивона', u'Ида', u'Изабелла', u'Изольда', u'Изяслав', u'Илария', u'Илзе', u'Илиана', u'Илона', u'Инара', u'Инга', u'Инесса', u'Инна', u'Иоанна', u'Иоланта', u'Ираида', u'Ирена', u'Ирина', u'Ирма', u'Исидора', u'Июлия', u'Ия',
        u'Калерия', u'Камилла', u'Капитолина', u'Карима', u'Карина', u'Каролина', u'Катарина', u'Кира', u'Кирилла', u'Клавдия', u'Клара', u'Кларисса', u'Климентина', u'Констанция', u'Кора', u'Кристина', u'Ксения',
        u'Лада', u'Лайма', u'Лана', u'Лариса', u'Лаура', u'Лейла', u'Лейсан', u'Леокадия', u'Леонида', u'Леся', u'Лиана', u'Лидия', u'Лилиана', u'Лилия', u'Лина', u'Линда', u'Лия', u'Лола', u'Лолита', u'Луиза', u'Лукерья', u'Любовь', u'Любомила', u'Людмила', u'Люция',
        u'Магда', u'Магдалина', u'Мадина', u'Майя', u'Малика', u'Мальвина', u'Маргарита', u'Марианна', u'Марика', u'Марина', u'Мария', u'Марселина', u'Марта', u'Марфа', u'Марьям', u'Матильда', u'Мелания', u'Мелисса', u'Мила', u'Милада', u'Милана', u'Милена', u'Милица', u'Милолика', u'Милослава', u'Мира', u'Мирдза', u'Мирослава', u'Мирра', u'Михайлина', u'Михаэла', u'Моника', u'Муза',
        u'Надежда', u'Назира', u'Наиля', u'Нана', u'Наталья', u'Нателла', u'Нелли', u'Неонила', u'Ника', u'Николь', u'Нина', u'Нинель', u'Нонна', u'Нора',
        u'Одетта', u'Оксана', u'Олеся', u'Оливия', u'Ольга', u'Офелия', u'Павла', u'Памела', u'Патриция', u'Пелагея', u'Полина', u'Прасковья',
        u'Рада', u'Радмила', u'Радосвета', u'Раиса', u'Ревекка', u'Регина', u'Рема', u'Рената', u'Римма', u'Роберта', u'Роза', u'Роксана', u'Ростислава', u'Рузанна', u'Рузиля', u'Румия', u'Руслана', u'Руфина',
        u'Сабина', u'Сабрина', u'Саида', u'Саломея', u'Сандра', u'Сания', u'Санта', u'Сарра', u'Светлана', u'Северина', u'Селена', u'Серафима', u'Сильва', u'Сима', u'Симона', u'Снежана', u'Созия', u'Софья', u'Станислава', u'Стелла', u'Стефания', u'Сусанна',
        u'Таира', u'Таисия', u'Тала', u'Тамара', u'Татьяна', u'Теодора', u'Тереза', u'Тина', u'Томила',
        u'Ульяна', u'Урсула', u'Устина', u'Фаиза', u'Фаина', u'Фания', u'Фаня', u'Фарида', u'Фатима', u'Фая', u'Фекла', u'Фелиция', u'Феруза', u'Флора', u'Франсуаза', u'Фредерика', u'Фрида',
        u'Харита', u'Хильда', u'Христина', u'Христя', u'Цветана', u'Цецилия', u'Чеслава', u'Чулпан', u'Шакира', u'Шарлотта',
        u'Эвелина', u'Эдда', u'Эдита', u'Элеонора', u'Элиза', u'Элина', u'Элла', u'Эллада', u'Элоиза', u'Эльвира', u'Эльга', u'Эльза', u'Эльмира', u'Эля', u'Эмилия', u'Эмма', u'Эрика', u'Эрнестина', u'Эсмеральда', u'Этери', u'Юзефа',
        u'Юлия', u'Юна', u'Юния', u'Юнона', u'Юханна', u'Ядвига', u'Яна', u'Янита', u'Янка', u'Ярина', u'Ярослава',
    )

    middle_names_m = (
        u'Александрович', u'Алексеевич', u'Альбертович', u'Анатольевич', u'Андреевич', u'Антонович', u'Аркадьевич', u'Артёмович',
        u'Богданович', u'Богуславович', u'Борисович',
        u'Вадимович', u'Валерьевич', u'Валентинович', u'Васильевич', u'Вениаминович', u'Викторович', u'Владимирович', u'Вячеславович',
        u'Геннадьевич', u'Георгиевич', u'Григорьевич', u'Давидович', u'Данилович', u'Денисович', u'Дмитриевич',
        u'Евгеньевич', u'Егорович', u'Ефимович', u'Иванович', u'Игоревич', u'Ильич', u'Иосифович', u'Кириллович', u'Константинович', u'Леонидович', u'Львович',
        u'Натанович', u'Наумович', u'Николаевич', u'Олегович', u'Оскарович', u'Павлович', u'Петрович', u'Платонович',
        u'Робертович', u'Романович', u'Ростиславович', u'Рубенович', u'Рудольфович', u'Русланович',
        u'Святославович', u'Семёнович', u'Сергеевич', u'Станиславович', u'Степанович',
        u'Тарасович', u'Тимофеевич', u'Тимурович', u'Фёдорович', u'Феликсович', u'Фелиппович',
        u'Эдуардович', u'Эльдарович', u'Юрьевич', u'Яковлевич', u'Ярославович',
    )

    middle_names_f = (
        u'Александровна', u'Алексеевна', u'Альбертовна', u'Анатольевна', u'Андреевна', u'Антоновна', u'Аркадьевна', u'Артёмовна', u'Архиповна', u'Аскольдовна', u'Афанасьевна',
        u'Богдановна', u'Болеславовна', u'Борисовна',
        u'Вадимовна', u'Валентиновна', u'Валерьевна', u'Васильевна', u'Вениаминовна', u'Викторовна', u'Владимировна', u'Владиславовна', u'Вячеславовна',
        u'Геннадьевна', u'Георгиевна', u'Григорьевна', u'Даниловна', u'Дмитриевна', u'Евгеньевна', u'Егоровна', u'Ефимовна',
        u'Ждановна', u'Ивановна', u'Игоревна', u'Ильинична', u'Кирилловна', u'Константиновна', u'Кузьминична', u'Леонидовна', u'Леоновна', u'Львовна',
        u'Натановна', u'Наумовна', u'Никифоровна', u'Николаевна', u'Ниловна', u'Олеговна', u'Оскаровна', u'Павловна', u'Петровна',
        u'Робертовна', u'Романовна', u'Рубеновна', u'Рудольфовна', u'Руслановна',
        u'Святославовна', u'Семёновна', u'Сергеевна', u'Станиславовна', u'Степановна',
        u'Тарасовна', u'Тимофеевна', u'Тимуровна', u'Фёдоровна', u'Феликсовна', u'Фелипповна',
        u'Эдуардовна', u'Эльдаровна', u'Юльевна', u'Юрьевна', u'Яковлевна',
    )

    @classmethod
    def last_name(cls):
        return cls.random_element(cls.last_names_m + cls.last_names_f)

    @classmethod
    def last_name_m(cls):
        return cls.random_element(cls.last_names_m)

    @classmethod
    def last_name_f(cls):
        return cls.random_element(cls.last_names_f)

    @classmethod
    def first_name(cls):
        return cls.random_element(cls.first_names_m + cls.first_names_f)

    @classmethod
    def first_name_m(cls):
        return cls.random_element(cls.first_names_m)

    @classmethod
    def first_name_f(cls):
        return cls.random_element(cls.first_names_f)

    @classmethod
    def middle_name(cls):
        return cls.random_element(cls.middle_names_m + cls.middle_names_f)

    @classmethod
    def middle_name_m(cls):
        return cls.random_element(cls.middle_names_m)

    @classmethod
    def middle_name_f(cls):
        return cls.random_element(cls.middle_names_f)
